app/controllers/card_sounds_controller.rb

SELECT * FROM "card_sounds" WHERE ("card_sounds"."id" = 0)
---
  def show
    @card_sound = CardSound.find(params[:id])