app/controllers/decks_controller.rb

  def quiz2
    @offset = params[:offset].to_i
    @deck = Deck.find(params[:id])
---
SELECT * FROM "decks" WHERE ("decks"."id" = 3)