app/controllers/decks_controller.rb

  def quiz
    @offset = params[:offset].to_i
    @deck = Deck.find(params[:id])
    if @offset + 1 > @deck.cards.size # no more cards left
---
SELECT * FROM "cards" WHERE ("cards".deck_id = 2)
SELECT count(*) AS count_all FROM "cards" WHERE ("cards".deck_id = 3)