app/controllers/decks_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "decks" WHERE ("decks"."user_id" = '1')
---
  def index
    @user = User.find(params[:user_id])
    @decks = Deck.find(:all, :conditions => { :user_id => params[:user_id] })

SELECT * FROM "decks" WHERE ("decks"."id" = 17)
---
  def all_decks
    @decks = Deck.find(:all)

SELECT * FROM "decks" WHERE ("decks"."id" = 1)
---
  def show
    @user = params[:user_id]
    @deck = Deck.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def new
    @user = User.find(params[:user_id])

SELECT * FROM "decks" WHERE ("decks"."id" = 1)
---
  def edit
    @deck = Deck.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" = '2') LIMIT 1
INSERT INTO "decks" ("name", "share", "created_at", "updated_at", "user_id") VALUES('test', 't', '2010-04-13 00:03:16', '2010-04-13 00:03:16', 2)
---
  def create
    @deck = Deck.new(params[:deck])
    @deck.user_id = current_user.id
    @user = User.find(params[:user_id])

    respond_to do |format|
      if @deck.save

SELECT * FROM "decks" WHERE ("decks"."id" = 4)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "decks" SET "updated_at" = '2010-04-12 12:00:58', "share" = 't' WHERE "id" = 24
---
  def update
    @deck = Deck.find(params[:id])
    @user = User.find(params[:user_id])

    respond_to do |format|
      if @deck.update_attributes(params[:deck])

SELECT * FROM "decks" WHERE ("decks"."id" = 1)
DELETE FROM "decks" WHERE "id" = 1
---
  def destroy
    @deck = Deck.find(params[:id])
    @deck.destroy

SELECT * FROM "decks" WHERE ("decks"."id" = 4)
---
  def quiz
    @deck = Deck.find(params[:id])