app/controllers/quiz_controller.rb

SELECT * FROM "decks" WHERE ("decks"."share" = 't')
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "users"
SELECT * FROM "decks"
SELECT count(*) AS count_all FROM "decks" WHERE ("decks".user_id = 1)
---
  def index
    @decks = Deck.find(:all, :conditions => { :share => true })  # for some reason, only true and 0 work
    @users = User.find(:all)

    @users = @users.find_all do |user|
      user.decks.size > 0

SELECT * FROM "decks" WHERE ("decks"."id" = 1)
---
  def quiz
    session[:quiz] = Quiz.new(Deck.find(params[:id]))