app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "password_salt", "persistence_token", "email") VALUES('2010-03-29 23:37:55', '97dc36dcad58cda60e6c1d2a7417c2397688eecd13b0ab70520460c21487731609b2b22a76fb074b5564b34dd3c3fb425cbc814bbb4a6060fa25a4757782e7f2', '2010-03-29 23:37:55', 'rob', 'tiX_N4Ca1hbK3FQWub7f', 'c7397351e6ad49bfcc0669e33cece88e96da365e5dc520a02577c278a4791c4950efaffa2c03b40bc1189eb53307eab89db93fb25ad7aaeb738988690cb09df3', 'rob.m.kaufman@gmail.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save